app/views/customers/show.html.haml

.col-md-8
  - if @customer.posts.any?
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."customer_id" = $1  [["customer_id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."customer_id" = $1  [["customer_id", 2]]