app/helpers/sessions_helper.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def current_customer
    if (customer_id = session[:customer_id])
      @current_customer ||= Customer.find_by(id: customer_id)