app/views/rooms/index.html.haml

          #messages
            - @room.posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."room_id" = $1  [["room_id", 5]]