app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."blacklist" = ?  [["blacklist", 0]]
---
  def index
    @customers = Customer.where(blacklist: false)