app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "cell", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Kеуs"], ["updated_at", "2022-01-06 18:05:48.061373"], ["id", 4]]
---
  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)

DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 7]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    Customer.find(params[:id]).destroy

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def following
    @title = "Читаю"
    @customer  = Customer.find(params[:id])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    @title = "Меня читают"
    @customer  = Customer.find(params[:id])