app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("content", "customer_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "www"], ["customer_id", 1], ["room_id", 1], ["created_at", "2022-05-05 18:52:08.771791"], ["updated_at", "2022-05-05 18:52:08.771791"]]
---
  def create
    @post = Post.new(post_params)
    @post.customer = current_customer
    @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])