app/controllers/rooms_controller.rb

  def show
    @rooms = Room.all
    render 'index'
    if @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms"
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @room = Room.new(room_params)
    @room.customer_id = current_customer.id

    if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "room 2"], ["created_at", "2022-05-05 03:47:47.406136"], ["updated_at", "2022-05-05 03:47:47.406136"]]

  def destroy
    @room.destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 3]]