app/models/customer.rb

  def add_to_blacklist
    if @customer.update(blacklist: true)
---
UPDATE "customers" SET "updated_at" = ? WHERE "customers"."id" = ?  [["updated_at", "2022-01-07 14:01:44.327249"], ["id", 2]]